
## Plan Result




<pre><code>Plan: 10 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_copyright_png
  * azurerm_storage_blob.b2c_favicon
  * azurerm_storage_blob.b2c_login_css
  * azurerm_storage_blob.b2c_login_html
  * azurerm_storage_blob.b2c_logo_gov
  * azurerm_storage_blob.b2c_mfa_css
  * azurerm_storage_blob.b2c_mfa_html
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_action_group.action_group
  * module.application_insights.azurerm_monitor_activity_log_alert.main
* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_copyright_png will be created
  + resource "azurerm_storage_blob" "b2c_copyright_png" {
      + access_tier            = (known after apply)
      + content_md5            = "ba68e29f2b8d6c98bbe820e2bf565ad2"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "copyright.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/copyright.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_favicon will be created
  + resource "azurerm_storage_blob" "b2c_favicon" {
      + access_tier            = (known after apply)
      + content_md5            = "de7abc5226925203ac10b0a4a94af949"
      + content_type           = "image/x-icon"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "favicon.ico"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/favicon.ico"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_login_css will be created
  + resource "azurerm_storage_blob" "b2c_login_css" {
      + access_tier            = (known after apply)
      + content_md5            = "f9883e1455fbb50d4737b194909ee05f"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "login.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/login.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_login_html will be created
  + resource "azurerm_storage_blob" "b2c_login_html" {
      + access_tier            = (known after apply)
      + content_md5            = "2d9dd23510b325ec54b12e22544e87c8"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "login.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/login.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_logo_gov will be created
  + resource "azurerm_storage_blob" "b2c_logo_gov" {
      + access_tier            = (known after apply)
      + content_md5            = "0c9e8639ea578c52504c066c5b805508"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "logo_gov.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/logo_gov.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_mfa_css will be created
  + resource "azurerm_storage_blob" "b2c_mfa_css" {
      + access_tier            = (known after apply)
      + content_md5            = "4f23b1397bc211d0f5d3f4ca720c3901"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "mfa.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/mfa.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_mfa_html will be created
  + resource "azurerm_storage_blob" "b2c_mfa_html" {
      + access_tier            = (known after apply)
      + content_md5            = "ad720484bf391450e55d8293e443e34f"
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "mfa.html"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/mfa.html"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.application_insights.azurerm_application_insights.this will be created
  + resource "azurerm_application_insights" "this" {
      + app_id                                = (known after apply)
      + application_type                      = "other"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 50
      + daily_data_cap_notifications_disabled = true
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "uksouth"
      + name                                  = "pre-stg-appinsights"
      + resource_group_name                   = "pre-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + workspace_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
    }

  # module.application_insights.azurerm_monitor_action_group.action_group will be created
  + resource "azurerm_monitor_action_group" "action_group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Pre-Stg-Warning-Alerts"
      + resource_group_name = "pre-stg"
      + short_name          = "pre-stg"
      + tags                = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + azure_function_receiver {
          + function_app_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/sds-alerts-slack-stg/providers/Microsoft.Web/sites/sds-alerts-slack-stg"
          + function_name            = "httpTrigger"
          + http_trigger_url         = (sensitive value)
          + name                     = "slack-alerts"
          + use_common_alert_schema  = true
        }
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + name                = "Application Insights daily cap reached"
      + resource_group_name = "pre-stg"
      + scopes              = (known after apply)
      + tags                = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }

      + action {
          + action_group_id    = (known after apply)
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "C02F3N771U7"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = (known after apply)
        }
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.109.148",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)

          + cors_rule {
              + allowed_headers    = [
                  + "*",
                ]
              + allowed_methods    = [
                  + "GET",
                  + "OPTIONS",
                ]
              + allowed_origins    = [
                  + "https://hmctsdevextid.b2clogin.com",
                ]
              + exposed_headers    = [
                  + "*",
                ]
              + max_age_in_seconds = 200
            }

            # (3 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 10 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":711,"Program":"tfcmt","SHA1":"","Vars":{}} -->